<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_10(7%EC%9B%9431%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

school_id_list = [{'name': 'John', 'job':"teacher", 'age': 40},
                  {'name': 'Nate', 'job':"teacher", 'age': 35},
                  {'name': 'Yuna', 'job':"teacher", 'age': 37},
                  {'name': 'Abraham', 'job':"student", 'age': 10},
                  {'name': 'Brian', 'job':"student", 'age': 12},
                  {'name': 'Janny', 'job':"student", 'age': 11},
                  {'name': 'Nate', 'job':"teacher", 'age': None},
                  {'name': 'John', 'job':"student", 'age': None}
                  ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [2]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [3]:
df.shape # None값 찾아내기(1)

(8, 3)

In [4]:
df.info() # None값 찾아내기(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [5]:
df.isna() # None값 찾아내기(2)

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [6]:
df.isnull() # None값 찾아내기(2)

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [7]:
df.age = df.age.fillna(0) # None 값을 발견하면 0으로 바꿔줌

In [8]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [9]:
school_id_list = [{'name': 'John', 'job':"teacher", 'age': 40},
                  {'name': 'Nate', 'job':"teacher", 'age': 35},
                  {'name': 'Yuna', 'job':"teacher", 'age': 37},
                  {'name': 'Abraham', 'job':"student", 'age': 10},
                  {'name': 'Brian', 'job':"student", 'age': 12},
                  {'name': 'Janny', 'job':"student", 'age': 11},
                  {'name': 'Nate', 'job':"teacher", 'age': None},
                  {'name': 'John', 'job':"student", 'age': None}
                  ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [10]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [12]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True) # median 이용해서 age값 바꾸기

In [13]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0